<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Имя конфигурации для магазина по умолчанию
    |--------------------------------------------------------------------------
    |
    | Здесь вы можете указать, какая из конфигураций будет использована
    | по умолчанию при подключении к API Робокассы
    |
    */
    'default' => env('ROBOKASSA_DEFAULT', 'default'),

    /*
    |--------------------------------------------------------------------------
    | Массив конфигураций для магазинов
    |--------------------------------------------------------------------------
    |
    | Вы можете добавить свою собственную конфигурацию, если требуется
    | использовать в проекте подключение более чем для одного магазина
    |
    */
    'merchants' => [
        'default' => [
            'login' => env('ROBOKASSA_LOGIN'),
            'password1' => env('ROBOKASSA_PASSWORD1'),
            'password2' => env('ROBOKASSA_PASSWORD2'),
            'test_password1' => env('ROBOKASSA_TEST_PASSWORD1'),
            'test_password2' => env('ROBOKASSA_TEST_PASSWORD2'),
            'is_test' => env('ROBOKASSA_IS_TEST', false),
            'hashType' => env('ROBOKASSA_HASH_TYPE', 'md5'),
        ],
    ],
];
